"""Проект з функціями
Калькулятор на основі функцій
Модульний калькулятор, використовує функції для різних операцій.

Базові арифметичні функції (додавання, віднімання, множення, ділення)
Обчислення степеня
Основна функція для обробки взаємодії з користувачем
Повторно використовувані компоненти обчислень
Фокус реалізації:

Створення чистих функцій з чіткими входами та виходами
Реалізація виклику функцій та значень, що повертаються
Демонстрація передачі параметрів
Використання функцій для організації коду
Інтерфейс користувача: Інтерфейс на основі функцій, де користувачі вводять числа та операції.

Виклики:

Розробити чисті інтерфейси функцій
Граціозно обробляти помилки
Створювати функції, які працюють разом
Реалізувати правильну логіку обчислень"""


"""Функція для виконання арифметичних операцій."""

def calc(x, y, operat):

    x, y = float(x), float(y)
    operat = str(operat)
    
    try:           
        if operat == "+":
            return x + y
        if operat == "-":
            return x - y
        if operat == "*":
            return x * y
        if operat == "/":
            return x / y if y != 0 else "Помилка"
        if operat == "**":
            return x ** y
            
        else: 
            return "Помилка: Невідома операція!"
            
    except ZeroDivisionError:
        print("Помилка: Введіть числові значення!")
        return None
    
"""Введення данних"""
print("\nВітаю у Модульному калькуляторі!")

"""Виведення документації про функцію"""
print(help(calc))  # Виведе довідку лише один раз перед початком обчислень    

x = input("Будь ласка, введить число: ")

while True:
    operat = (input("Функція (+, -, *, /, **, exit - вихід з програми):  "))
    if operat.lower() == "exit":
        print("Вихід з програми. \nДякуємо, що скористалися нашим калькулятором!")
        break

    y = input("Будь ласка, введіть наступне число: ")
    
    """Виклик функції та оновлення значення x"""
    x = calc(x, y, operat)
    
    """Виведення результату"""
    print(f"{operat} {y} = {x}")