"""Цикл по діапазону з кроком
Задача:

Використовуйте цикл for з range(), щоб вивести кожне третє число між 10 і 30 (включно)
Після виведення чисел виведіть суму цих чисел"""

# Створюємо порожній список
sort_num = []

# Формуємо список впорядковими числами з 10 до 30 (включно) з кроком - 3
for num in range(10, 31, 3):   # Одбираємо числа згідно вимог
    sort_num.append(num)   # Додаємо числа які відповідають вимогам до списку
    print(f"\n{(num)}")   # Виводимо  отриманий список чисел у вигляді стовбчика

# Виводимо загальну сумму  отриманого списку
print(f"\nSum: {sum(sort_num)}")