"""Вкладені цикли для виведення матриці
Задача: Створіть 2D список (матрицю), що представляє сітку чисел:

matrix = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]
Використовуйте вкладений цикл for, щоб вивести кожен рядок матриці на новий рядок
Модифікуйте програму для обчислення суми значень у кожному рядку та виведення суми після кожного рядка"""

matrix = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

# Обчислює суму кожного рядка
for i, row in enumerate(matrix):
    row_sum = 0
    for value in row:
        row_sum += value

     # Виведення кожного рядка матриці на новий рядок з сумою значень       
    print(f"\n{matrix[i]}   Sum: {row_sum}")