""" Цикл по списку та модифікація елементів
Задача:

Створіть список цілих чисел: [3, 7, 1, 9, 4]
Використовуйте цикл for для ітерації по списку та:
Помножте кожне число на 3
Замініть числа більші за 15 на 'Too large'
Виведіть модифікований список після циклу"""


numbers = [3, 7, 1, 9, 4]

# Модифікуємо список
for index, num in enumerate(numbers):
    num *= 3 # Помножуємо кожне число на 3
    if num > 15:  # Перевіряємо значення елемента, а не його індекс
        numbers[index] = "Too large"  # Замінюємо числа, які більше за 15
    else:
        numbers[index] = num

# Вивід модифікованого списку
print(numbers)