"""Модифікувати значення у вкладеному списку
Задача: Вам дано вкладений список, який представляє сітку чисел. Ваше завдання полягає у використанні вкладених циклів для зміни деяких значень у сітці на основі певних умов.

Ввід: 2D список (вкладений список), що містить цілі числа. Приклад:

grid = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]
Умови:

Якщо число парне, подвоїти його значення
Якщо число непарне, замінити його на 0"""

grid = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

# Використання вкладеного циклу для модифікації значень
for i in range(len(grid)): # Ітеруємося по рядках
    for j in range(len(grid[i])): # Ітеруємося по числах у рядку
        if grid[i][j] % 2 == 0:  # Перевіряємо парні числа
            grid[i][j] *= 2  # Подвоюємо значення
        else:  # Якщо число непарне
            grid[i][j] = 0  # Замінюємо на 0

# Вивід модифікованого 2D списку
for row in grid:
    print(row)