"""Сума парних чисел у списку
Задача:

Створіть список цілих чисел: [10, 20, 30, 40, 50, 11, 17, 22]
Використовуйте цикл for для ітерації по списку та обчисліть суму лише парних чисел
Виведіть суму парних чисел і скільки парних чисел було знайдено"""

numeric = [10, 20, 30, 40, 50, 11, 17, 22]
even = [] # Створення порожнього списку

# На основі наданого списку формуємо новий список
for index, num in enumerate(numeric):
    if num % 2 == 0:  # Сортування парних чисел
        even.append(num) # Додавання парних чисел до нового списку

# Вивід значень: суми чисел і кількість чисел у новому сформованому списку
print(f"Sum of even numbers: {sum(even)}\nNumber of even numbers: {len(even)}")