print()
print("Помічник прийняття рішень")
print("Вітаємо у системі рекомендацій активностей!")

print("Оберить, будь ласка, погоду за категорією.")
print("1 - сонячно,", "2 - дощово,", "3 - холодно," "4 - сніжно")
weather = int(input("Введіть категорію погоди (1, 2, 3): "))

print("Оберить, будь ласка, Ваше віддчіття енергії за категорією.")
print("1 - високий,", "2 - середній,", "3 - низький")
energy = int(input("Введіть рівень енергії (1, 2, 3): "))

if weather not in [1, 2, 3] or energy not in [1, 2, 3]:\
    raise SystemExit("Некоректне введення данних. Будь ласка, спробуйте знову.")

time_available = int(input("Введіть доступний час у хвилинах: "))
if weather == 1:
    if energy == 1:
        activity = "Йдіть у похід або займіться активним спортом на відкритому повітрі!" if time_available > 120 \
            else "Катайтеся на велосипеді! Пробіжка на відкритому просторі!" if time_available > 60 \
            else "Невелика розмінка або біг на місті" if time_available > 30 else "Співайте, танцуйте!"
    elif energy == 2:
        activity = "Прогулянка в парку, читання на природі або фотографування." if time_available > 120 \
            else "Прогулянка на свіжому повітрі" if time_available > 60 \
            else "Займіться йогою або медитацією" if time_available > 30 else "Слухайте музику"
    else:
        activity = "Прогулянка с прослуховуванням улюбленої музики на свіжому повітрі." if time_available > 120 \
            else "Медитація" if time_available >60 \
            else "Кава на свіжому повітрі" if time_available > 30 else "Слухайте музику"

elif weather == 2:
    if energy == 1:
        activity = "Прийміть участь в екскурсіях в музеї, відвідуйте виставки, поїдьте в театр" if time_available > 120 \
            else "Займіться тренуванням вдома, танцями або спробуйте кулінарні експерименти!" if time_available > 60 \
            else "Невелика розмінка або біг на місті" if time_available > 30 else "Співайте, танцуйте!"
    elif energy == 2:
        activity = "Спробуйте кулінарні експерименти, грайте в настільні ігри або творча діяльність." if time_available > 120 \
            else "Займіться улюбленим хоббі або читання кніг" if time_available > 60 \
            else "Невелика розмінка на місті" if time_available > 30 else "Слухайте музику під чашку чая або кави"
    else:
        activity = "Перегляд фільму." if time_available > 120 \
            else "Прослуховування музики" if time_available > 30 else "Pелакс із чашкою чаю." 

elif weather == 3:
    if energy == 1:
        activity = "Єкскурсійні поїздки, відвідування соціальних заходів" if time_available > 120 \
            else "Прогулянка в парку, на відкритому повітрі" if time_available > 60 \
            else "Невелика прогулянка" if time_available < 30 else "Співайте, танцуйте в дому!"
    elif energy == 2:
        activity = "Відвідуйте басейн або СПА, сходить у кінотеатр" if time_available > 120 \
            else "Приготування сезонних страв або опанування нового хобі." if time_available > 60 \
            else "Займітесь улюбленим хоббі" if time_available < 30 else "Танцюйте, слухайте музику"
    else:
        activity = "Теплий плед, гарячий напій та улюблена книга або фільм."

elif weather == 4:
    if energy == 1:
        activity = "Катання на лижах, ковзанах!" if time_available > 120 \
            else "Прогулянка в парку, ігри на відкритому повітрі" if time_available > 60 \
            else "Невелика прогулянка" if time_available < 30 else "Співайте, танцуйте в дому!"
    elif energy == 2:
        activity = "Прогулянка на свіжому повітрі" if time_available > 120 \
            else "Невелика прогулянка або приготування сезонних страв, опанування нового хобі." if time_available > 60 \
            else "Танцюйте, слухайте музику" if time_available < 30 else "Займітесь медитацієй, релаксом"
    else:
        activity = "Займітесь медитацієй, релаксом, слухайте улюблену музику" if time_available > 120 \
            else "Теплий плед, гарячий напій та улюблена книга або фільм."

else:
    activity = "Некоректне введення данних. Будь ласка, спробуйте знову."

print("\nРекомендована активність:", activity)
print("Гарного проведення часу!")